Tekla Open API Reference for Tekla Structures 2025
ImageItem.Picture Property
 Gets or sets the image.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Image Picture { get; set; }
Public Property Picture As Image
	Get
	Set
Property Value
Type: Image
See Also
Reference
ImageItem Class
Tekla.Structures.Dialog.UIControls Namespace